# 05 Membalik Urutan Baris dan Kolom pada Data Frame

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

Persiapan Data Frame

In [2]:
import pandas as pd
import numpy as np
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)

df

   A  B  C  D  E
0  2  2  6  2  9
1  2  3  2  7  1
2  3  4  3  1  3
3  4  2  9  5  5
4  3  9  9  4  9

Membalik Urutan Kolom

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  9  2  6  2  2
1  1  7  2  3  2
2  3  1  3  4  3
3  5  5  9  2  4
4  9  4  9  9  3

Membalik Urutan Baris

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  3  9  9  4  9
3  4  2  9  5  5
2  3  4  3  1  3
1  2  3  2  7  1
0  2  2  6  2  9

Membalik Urutan Baris dan Melakukan Penyesuaian Ulang Index

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  9  9  4  9
1  4  2  9  5  5
2  3  4  3  1  3
3  2  3  2  7  1
4  2  2  6  2  9

# 06 Mengganti Nama (label) Kolom pada Data Frame

Import Modules

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

Persiapan Data Frame

In [7]:
import pandas as pd
import numpy as np
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)

df

   A  B  C  D  E
0  1  6  1  8  9
1  7  9  7  5  7
2  6  7  5  9  1
3  2  7  6  6  6
4  7  3  3  5  2

Mengganti Nama (label) Untuk Sebuah Kolom pada Data Frame

In [8]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  1  6     1  8  9
1  7  9     7  5  7
2  6  7     5  9  1
3  2  7     6  6  6
4  7  3     3  5  2

Mengganti Nama (label) Untuk Banyak Kolom pada Data Frame

In [9]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     1       6  1     8  9
1     7       9  7     5  7
2     6       7  5     9  1
3     2       7  6     6  6
4     7       3  3     5  2

# 07 Menghapus (drop) Missing Values (NaN) pada Data Frame

Persiapan Data Frame

In [10]:
import pandas as pd
import numpy as np
data = {'Z' : np.random.rand(10), 'A': np.random.rand(10), 'B':np.random.rand(10),'C':np.random.rand(10),'D':np.random.rand(10)}
df = pd.DataFrame(data)
df.iloc[2:5, 0] = np.nan
df.iloc[7, 2] = np.nan

df.head()

          Z         A         B         C         D
0  0.589785  0.273043  0.758765  0.214746  0.765676
1  0.746514  0.429942  0.640423  0.714615  0.924811
2       NaN  0.261524  0.502860  0.129401  0.238334
3       NaN  0.465791  0.849097  0.567609  0.124873
4       NaN  0.621559  0.480293  0.725089  0.600465

In [11]:
df = df.rename(columns={'index':'Z'})
df.head()

          Z         A         B         C         D
0  0.589785  0.273043  0.758765  0.214746  0.765676
1  0.746514  0.429942  0.640423  0.714615  0.924811
2       NaN  0.261524  0.502860  0.129401  0.238334
3       NaN  0.465791  0.849097  0.567609  0.124873
4       NaN  0.621559  0.480293  0.725089  0.600465

In [12]:
df_backup = df.copy(deep=True)

Menghapus (drop) Setiap Kolom yang Mengandung Missing Values

In [13]:
df = df.dropna(axis='columns')
df.head()

          A         C         D
0  0.273043  0.214746  0.765676
1  0.429942  0.714615  0.924811
2  0.261524  0.129401  0.238334
3  0.465791  0.567609  0.124873
4  0.621559  0.725089  0.600465

Menghapus (drop) Setiap Baris yang Mengandung Missing Values

In [14]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')

df.head()

          Z         A         B         C         D
0  0.589785  0.273043  0.758765  0.214746  0.765676
1  0.746514  0.429942  0.640423  0.714615  0.924811
5  0.004142  0.963425  0.194179  0.517169  0.030687
6  0.053624  0.473435  0.929765  0.702085  0.909883
8  0.662935  0.305789  0.718047  0.266458  0.726292

Persentase missing values untuk tiap kolom

In [15]:
df = df_backup.copy(deep=True)
df.isna().mean() * 100

Z    30.0
A     0.0
B    10.0
C     0.0
D     0.0
dtype: float64

Menghapus (drop) Setiap Kolom yang Mengandung Missing Values Berdasarkan Threshold (ambang batas)

In [16]:
threshold = len(df) * 0.9
df = df.dropna(thresh=threshold, axis='columns')

df.head()

          A         B         C         D
0  0.273043  0.758765  0.214746  0.765676
1  0.429942  0.640423  0.714615  0.924811
2  0.261524  0.502860  0.129401  0.238334
3  0.465791  0.849097  0.567609  0.124873
4  0.621559  0.480293  0.725089  0.600465

# 08 Memeriksa Kesamaan Antar Dua Buah Kolom (Series) pada Data Frame

Import Modules

In [17]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

Persiapan Data Frame

In [18]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [19]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [20]:
type(df['A'])

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

Memeriksa Kesamaan dengan Operator

In [22]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

Memeriksa kesamaan dengan method equals()

In [23]:
df['A'].equals(df['B'])

True

Memeriksa Kesamaan Antar Dua Data Frame

In [24]:
df1 = df.copy(deep=True)
df.equals(df1)

True

In [25]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True